test/test_msp_cfdem_solver_impl_FD/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
  (0 0 0)
  (1 0 0)
  (1 1 0)
  (0 1 0)
  (0 0 4)
  (1 0 4)
  (1 1 4)
  (0 1 4)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (10 10 40) simpleGrading (1 1 1)
);

edges
(
);

patches
(
  wall inlet
  (
    (0 3 2 1)
  )
  wall wall
  (
    (2 6 5 1)
    (0 4 7 3)
    (3 7 6 2)
    (1 5 4 0)
  )
  wall outlet
  (
    (4 5 6 7)
  )
);

mergePatchPairs
(
);
